{
  "model_type": "qwen3_agentic",
  "architectures": [
    "Qwen3Agentic"
  ],
  "compressor_config": {
    "base_model": "/home/slgx/yuhong/base_model/Qwen/Qwen3-0.6B",
    "model_type": "compressor",
    "architectures": [
      "Qwen3ForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "eos_token_id": 151645,
    "membos_token_id": 151668,
    "memeos_token_id": 151669,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 1024,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "max_position_embeddings": 40960,
    "max_window_layers": 28,
    "num_attention_heads": 16,
    "num_hidden_layers": 28,
    "num_key_value_heads": 8,
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "rope_theta": 1000000,
    "sliding_window": null,
    "tie_word_embeddings": true,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.56.1",
    "use_cache": true,
    "use_sliding_window": false,
    "vocab_size": 151936,
    "max_segment_length": 2048,
    "mem_token_num": 512
  },
  "converter_config": {
    "model_type": "converter",
    "architectures": [
      "Qwen3MLP"
    ],
    "input_hidden_size": 1024,
    "output_hidden_size": 5120,
    "intermediate_size": 3072,
    "hidden_act": "silu",
    "rms_norm_eps": 1e-06
  },
  "decoder_config": {
    "model_type": "decoder",
    "base_model": "/home/slgx/yuhong/base_model/Qwen/Qwen3-14B",
    "architectures": [
      "Qwen3ForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "eos_token_id": 151645,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 5120,
    "initializer_range": 0.02,
    "intermediate_size": 17408,
    "max_position_embeddings": 40960,
    "max_window_layers": 40,
    "num_attention_heads": 40,
    "num_hidden_layers": 40,
    "num_key_value_heads": 8,
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "rope_theta": 1000000,
    "sliding_window": null,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.56.1",
    "use_cache": true,
    "use_sliding_window": false,
    "vocab_size": 151936
  },
  "auto_map": {
    "AutoConfig": "configuration_qwen_agentic.Qwen3AgenticConfig",
    "AutoModel": "modeling_qwen_agentic.Qwen3Agentic",
    "AutoModelForCausalLM": "modeling_qwen_agentic.Qwen3Agentic"
  },
  "torch_dtype": "bfloat16",
  "transformers_version": "4.56.1"
}